mach-3-tunnel-with-step/rhoCentralFoam40/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          3200;
        startFace       564800;
    }
    outlet
    {
        type            patch;
        nFaces          1600;
        startFace       568000;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          3200;
        startFace       569600;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1600;
        startFace       572800;
    }
    step
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3200;
        startFace       574400;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9600;
        startFace       577600;
    }
)

// ************************************************************************* //
